IDEA StatiCa Open Model
Element2D.GeometricRegion Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Geometry region of element2D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement GeometricRegion { get; set; }
Public Property GeometricRegion As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ GeometricRegion {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
Element2D Class
IdeaRS.OpenModel.Model Namespace